08-ajax/food_trucking/app/views/dishes/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 1]]
---
    <footer class="content">
      <div class="likes-count pull-right"><%= dish.likes.count %></div>

SELECT "dishes".* FROM "dishes"
---

  $('.star').on('click', function(event) {

    var dish_id = $(event.target)
      .closest('.ui-card')
      .data('dish-id');

    $.ajax({
      url: '/api/likes',
      method: 'post',
      beforeSend: function (xhr) {
        xhr.setRequestHeader('X-CSRF-Token', token)
      },
      data: { dish_id: dish_id }
    }).done(function(resp) {
      // on done function update likes count in dom
      var $likesCount = $(event.target)
        .closest('.ui-card')
        .find('.likes-count');

      $likesCount.text(resp.likes_count);
    });