08-ajax/food_trucking/app/views/dishes/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."dish_id" = $1  [["dish_id", 1]]
---
<div class="comments">
<% @dish.comments.each do |comment| %>